blazoncek/esp8266_mqtt_leds/effects.cpp
#include <stdint.h>
#include <math.h>
#include <Arduino.h>
#include <ESP8266WiFi.h>          // Base ESP8266 includes
#include <FastLED.h>


#include "eepromdata.h"
#include "effects.h"


// This is an array of leds.  One item for each led in your strip.
extern CRGB *leds[], gRGB;
extern uint8_t gHue, gBrightness;

boolean breakEffect = false;
byte *heat[MAXZONES]; // Fire effect static data (for each zone; max 8); allocated in setup()

typedef void (*NewKITTPatternList[])(CRGB, int, int, boolean);
static NewKITTPatternList gPatterns = {
  LeftToRight,
  RightToLeft,
  OutsideToCenter,
  CenterToOutside,
  RightToLeft,
  LeftToRight,
  OutsideToCenter,
  CenterToOutside
  };
static uint8_t gCurrentPattern = 0;
static uint8_t gBeat = 0;


effect_name_t effects[] = {
  {OFF,                  "Off"},
  {SOLID,                "Solid Color"},
  {FADEINOUT,            "Fade In&Out"},
  {STROBE,               "Strobe"},
  {HALLOWEENEYES,        "Haloween Eyes"},
  {CYLONBOUNCE,          "Cylon Bounce"},
  {NEWKITT,              "New KITT"},
  {TWINKLE,              "Twinkle"},
  {TWINKLERANDOM,        "Twinkle random"},
  {SPARKLE,              "Sparkle"},
  {SNOWSPARKLE,          "Snow Sparkle"},
  {RUNNINGLIGHTS,        "Running lights"},
  {COLORWIPE,            "Color Wipe"},
  {RAINBOWCYCLE,         "Rainbow Cycle"},
  {THEATRECHASE,         "Theatre Chase"},
  {RAINBOWCHASE,         "Rainbow Chase"},
  {FIRE,                 "Fire"},
  {BOUNCINGBALL,         "Bouncing ball"},
  {BOUNCINGCOLOREDBALLS, "3 bouncing balls"},
  {METEORRAIN,           "Meteor"},
  {SINELON,              "SineLon"},
  {BPM,                  "Pusling Colors"},
  {JUGGLE,               "8 juggling dots"},
  {COLORCHASE,           "Color Chase"},
  {CHRISTMASCHASE,       "Christmass Chase"},
  {RAINBOWBOUNCE,        "Rainbow Bounce"}
};


char const *effect_names[] = {
  "Off",
  "Solid Color",
  "Fade In&Out",
  "Strobe",
  "Haloween Eyes",
  "Cylon Bounce",
  "New KITT",
  "Twinkle",
  "Twinkle random",
  "Sparkle",
  "Snow Sparkle",
  "Running lights",
  "Color Wipe",
  "Rainbow Cycle",
  "Theatre Chase",
  "Rainbow Chase",
  "Fire",
  "Bouncing ball",
  "3 bouncing balls",
  "Meteor",
  "SineLon",
  "Pusling Colors",
  "8 juggling dots",
  "Color Chase",
  "Christmass Chase",
  "Rainbow Bounce"
};

// *************************
// ** LEDEffect Functions **
// *************************

//------------------------------------------------------//
void solidColor(CRGB c) {
  //showColor(&c)
  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], c);
  }
  showStrip();
  FastLED.delay(10);  
}

//------------------------------------------------------//
void RGBLoop() {
  static int count = 0;
  
  if ( count < 256 ) {  // 256 up, 256 down
    gHue = HUE_RED;
  } else if ( count < 512 ) {
    gHue = HUE_GREEN;
  } else {
    gHue = HUE_BLUE;
  }
  FadeInOut();

  if ( ++count == 768 ) count = 0;
}

//------------------------------------------------------//
void FadeInOut() {
  CRGB c = CHSV(gHue, 255, triwave8(beat8(20)));
  if ( triwave8(beat8(20))<5 ) gHue += 8;
  
  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], c);
  }
  showStrip();
  FastLED.delay(15);
}

//------------------------------------------------------//
void Strobe(CRGB c, int FlashDelay) {

  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], c);
  }
  showStrip();
  FastLED.delay(FlashDelay/2);
  
  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], CRGB::Black);
  }
  showStrip();
  FastLED.delay(FlashDelay/2);
}

//------------------------------------------------------//
void HalloweenEyes(CRGB c, int EyeWidth, int EyeSpace, boolean Fade) {
  int i;
  static unsigned long wait = 0;

  if ( wait > millis() ) {
    return;
  }
  wait = millis() + random16(500,2500);
  
  for ( int z=0; z<numZones; z++ ) {

    if ( Fade )
      fadeToBlackBy(leds[z], numLEDs[z], 196);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      int StartPoint = random16(sectionStart[z][s], sectionEnd[z][s] - (2*EyeWidth) - EyeSpace);
      int Start2ndEye = StartPoint + EyeWidth + EyeSpace;

      // show eyes
      for ( i=0; i<EyeWidth; i++ ) {
        leds[z][StartPoint + i] = leds[z][Start2ndEye + i] = c;
      }
    }
  }
  showStrip();
  FastLED.delay(15);
}

//------------------------------------------------------//
void CylonBounce(int EyeSizePct, int SweepsPerMinute) {
  static boolean dir = false;   // start left-to-right
  static unsigned int pct = 0;  // starting position
  CRGB c = CRGB::Red;
  
  uint8_t beat = beat8(SweepsPerMinute)*100/255;
  if ( pct == beat ) {  // if there is no change in position just exit
    FastLED.delay(15);
    return;
  } else if ( pct > beat ) {  // roll-over, erase the section
    dir = !dir;
  }
  pct = beat; // percent fill

  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], CRGB::Black);
    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      unsigned int EyeSize = max(1,(int)(EyeSizePct * ledsPerSection / 100));
      unsigned int pos = sectionStart[z][s] + (((dir?100-pct:pct) * (ledsPerSection-(EyeSize+2))) / 100);
      leds[z][pos] = leds[z][pos+EyeSize+1] = c/8;
      for ( int j=1; j<=EyeSize; j++ ) {
        leds[z][pos+j] = c; 
      }
    }
  }
  showStrip();
  FastLED.delay(15);
}

#define ARRAY_SIZE(A) (sizeof(A) / sizeof((A)[0]))
void nextPattern() {
  gCurrentPattern = (gCurrentPattern + 1) % ARRAY_SIZE(gPatterns);
//  if ( gCurrentPattern == 0 )
    gHue += 4;
}

//------------------------------------------------------//
void NewKITT(int EyeSizePct, int SweepsPerMinute) {
  CRGB c = CHSV(gHue, 255, 255);
  uint8_t newB;
  
  if ( gPatterns[gCurrentPattern]==CenterToOutside || gPatterns[gCurrentPattern]==OutsideToCenter ) {
    newB = beat8(2*SweepsPerMinute);
  } else {
    newB = beat8(SweepsPerMinute);
  }

  // Call the current pattern function once, updating the 'leds' array
  if ( newB > gBeat ) {
    gPatterns[gCurrentPattern](c, EyeSizePct, SweepsPerMinute, true);
  } else {
    nextPattern();
  }
  gBeat = newB;
  FastLED.delay(15);
}

// used by NewKITT
void CenterToOutside(CRGB c, int EyeSizePct, int SweepsPerMinute, boolean Fade) {
  unsigned int EyeSize;
  uint8_t beat = beat8(2*SweepsPerMinute);
  unsigned int pct = 50 - (beat*50)/255;
  
  for ( int z=0; z<numZones; z++ ) {

    if ( Fade )
      fadeToBlackBy(leds[z], numLEDs[z], 64);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      EyeSize = EyeSizePct * ledsPerSection / 100;
      unsigned int pos = ((pct * (ledsPerSection-EyeSize)) / 100);

      for ( int j=0; j<EyeSize; j++ ) {
        leds[z][sectionStart[z][s]+pos+j] = leds[z][sectionEnd[z][s]-pos-j] = c; 
      }
    }
  }
  showStrip();
}

// used by NewKITT
void OutsideToCenter(CRGB c, int EyeSizePct, int SweepsPerMinute, boolean Fade) {
  unsigned int EyeSize;
  uint8_t beat = beat8(2*SweepsPerMinute);
  unsigned int pct = (beat*50)/255;
  
  for ( int z=0; z<numZones; z++ ) {

    if ( Fade )
      fadeToBlackBy(leds[z], numLEDs[z], 64);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      EyeSize = EyeSizePct * ledsPerSection / 100;
      unsigned int pos = ((pct * (ledsPerSection-EyeSize)) / 100);

      for ( int j=1; j<=EyeSize; j++ ) {
        leds[z][sectionStart[z][s]+pos+j] = leds[z][sectionEnd[z][s]-pos-j] = c; 
      }
    }
  }
  showStrip();
}

// used by NewKITT
void LeftToRight(CRGB c, int EyeSizePct, int SweepsPerMinute, boolean Fade) {
  unsigned int EyeSize;
  uint8_t beat = beat8(SweepsPerMinute);
  unsigned int pct = (beat*100)/255;
  
  for ( int z=0; z<numZones; z++ ) {

    if ( Fade )
      fadeToBlackBy(leds[z], numLEDs[z], 64);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      EyeSize = EyeSizePct * ledsPerSection / 100;
      unsigned int pos = sectionStart[z][s] + ((pct * (ledsPerSection-EyeSize)) / 100);

      for ( int j=0; j<EyeSize; j++ ) {
        leds[z][pos+j] = c; 
      }
    }
  }
  showStrip();
}

// used by NewKITT
void RightToLeft(CRGB c, int EyeSizePct, int SweepsPerMinute, boolean Fade) {
  unsigned int EyeSize;
  uint8_t beat = beat8(SweepsPerMinute);
  unsigned int pct = 100 - (beat*100)/255;
  
  for ( int z=0; z<numZones; z++ ) {

    if ( Fade )
      fadeToBlackBy(leds[z], numLEDs[z], 64);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      EyeSize = EyeSizePct * ledsPerSection / 100;
      unsigned int pos = sectionStart[z][s] + ((pct * (ledsPerSection-EyeSize)) / 100);

      for ( int j=0; j<EyeSize; j++ ) {
        leds[z][pos+j] = c; 
      }
    }
  }
  showStrip();
}

