blazoncek/esp8266_mqtt_leds/effects.cpp
//------------------------------------------------------//
void Twinkle(int SpeedDelay, boolean OnlyOne) {
  CRGB c = CHSV(gHue, 255, 255);
  
  for ( int z=0; z<numZones; z++ ) {

    if ( !OnlyOne )
      fadeToBlackBy(leds[z], numLEDs[z], 16);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      int pos = random16(sectionStart[z][s], sectionEnd[z][s]);
      leds[z][pos] = c;
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}

//------------------------------------------------------//
void TwinkleRandom(int SpeedDelay, boolean OnlyOne) {
  gHue = random8();
  Twinkle(SpeedDelay, OnlyOne);
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void sinelon(int SpeedDelay) {

  // a colored dot sweeping back and forth, with fading trails
  for ( int z=0; z<numZones; z++ ) {
    fadeToBlackBy(leds[z], numLEDs[z], 16);
    for ( int s=0; s<numSections[z]; s++ ) {
      int pos = beatsin16(12, sectionStart[z][s], sectionEnd[z][s]-1);
      if ( s%2 )
        pos = (sectionEnd[z][s]-1-pos) + sectionStart[z][s];
      leds[z][pos] = CHSV(gHue, 255, 255);
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);

  gHue++;
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void bpm(int SpeedDelay) {

  // colored stripes pulsing at a defined Beats-Per-Minute (BPM)
  uint8_t BeatsPerMinute = 62;
  CRGBPalette16 palette = RainbowColors_p; // PartyColors_p;
  uint8_t beat = beatsin8(BeatsPerMinute, 32, 255);
  for ( int z=0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      for ( int i=sectionStart[z][s]; i<sectionEnd[z][s]; i++ ) { //9948
        leds[z][i] = ColorFromPalette(palette, gHue+((i-sectionStart[z][s])*2), beat-gHue+((i-sectionStart[z][s])*10));
      }
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);

  gHue++;
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void juggle(int SpeedDelay) {

  // eight colored dots, weaving in and out of sync with each other
  for ( int z=0; z<numZones; z++ ) {
    fadeToBlackBy(leds[z], numLEDs[z], 64);
    for ( int s=0; s<numSections[z]; s++ ) {
      byte dothue = 0;
      for ( int i=0; i<8; i++ ) {
        int pos = beatsin16(i+7, sectionStart[z][s], sectionEnd[z][s]-1);
        if ( s%2 )
          pos = (sectionEnd[z][s]-1-pos) + sectionStart[z][s];
        leds[z][pos] |= CHSV(dothue, 255, 255);
        dothue += 32;
      }
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}


//------------------------------------------------------//
void Sparkle(int SpeedDelay, CRGB c) {

  for ( int z=0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], c);
    for ( int s=0; s<numSections[z]; s++ ) {
      addGlitter(z, s, 75);
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}

//------------------------------------------------------//
void snowSparkle(int SpeedDelay) {
  Sparkle(SpeedDelay, CRGB(16,16,16));
}

//------------------------------------------------------//
void runningLights(int WaveDelay) {
  static unsigned int offset = 0;
  
  for ( int z=0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      for ( int i=0; i<ledsPerSection; i++ ) {
        unsigned int level = sin8( (i*1280/ledsPerSection + offset) & 0xFF );  // 5 waves
        leds[z][sectionStart[z][s] + i] = CHSV(gHue, 255, level);
      }
    }
  }
  showStrip();
  FastLED.delay(WaveDelay);

  gHue++;
  offset = (offset + 21) & 0xFF;
}

//------------------------------------------------------//
void colorWipe(int WipesPerMinute, boolean Reverse) {
  static unsigned int pct = 0;  // starting position
  static boolean blank = false;
  CRGB c;

  uint8_t beat = (beat8(WipesPerMinute*2)+2)*100/255; // double the speed (colored & black wipes)
  if ( pct == beat ) {  // if there is no change in position just exit
    FastLED.delay(5);
    return;
  } else if ( pct > beat && pct > 99 ) {  // roll-over, erase the section
    blank = !blank;
    if ( blank ) gHue += 8;
  } else if ( pct > beat && pct < 100 ) {
    beat = 100;
  }
  pct = beat; // percent fill
  
  if ( blank ) {
    c = CRGB::Black;
  } else {
    c = CHSV(gHue, 255, 255);
  }
  for ( int z=0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      unsigned int nLeds = (pct * ledsPerSection) / 100;
      if ( Reverse ) {
        fill_solid(&leds[z][sectionEnd[z][s]-nLeds-1], nLeds, c);
      } else {
        fill_solid(&leds[z][sectionStart[z][s]], nLeds, c);
      }
    }
  }
  showStrip();
  FastLED.delay(5);
}

//------------------------------------------------------//
void colorChase(CRGB c[], int Size, int SpeedDelay, boolean Reverse) {
  int window = 3*Size;  // c[] has 3 elements
  int pos;
  
  // move by 1 pixel within window
  for ( int q=0; q<window; q++ ) {

    for ( int z=0; z<numZones; z++ ) {
      fill_solid(leds[z], numLEDs[z], c[2]);
      for ( int s=0; s<numSections[z]; s++ ) {
        int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
        for ( int i=0; i<ledsPerSection; i+=window ) {
          // turn LEDs on: ..++++####....++++####..   (size=4, . = black, + = c1, # = c2)
          // turn LEDs on: ..####++++....####++++..   (size=4, . = black, + = c1, # = c2, Reverse)
          for ( int j=0; j<Size; j++ ) {
            if ( Reverse ) {
              pos = (window-q-1) + (Size-j-1);
              if ( (pos+Size)%window + i < ledsPerSection )
                leds[z][sectionStart[z][s] + (pos+Size)%window + i] = c[0];
              if ( pos%window + i < ledsPerSection )
                leds[z][sectionStart[z][s] + pos%window + i] = c[1];
            } else {
              pos = q + j;
              if ( pos%window + i < ledsPerSection )
                leds[z][sectionStart[z][s] + pos%window + i] = c[0];
              if ( (pos+Size)%window + i < ledsPerSection )
                leds[z][sectionStart[z][s] + (pos+Size)%window + i] = c[1];
            }
          }
        }
      }
    }
    showStrip();
    FastLED.delay(SpeedDelay/Size);
  }
}

