blazoncek/esp8266_mqtt_leds/effects.cpp
//------------------------------------------------------//
void meteorRain(byte meteorSizePct, byte meteorTrailDecay, boolean meteorRandomDecay, int SpeedDelay) {  
  unsigned int meteorSize;
  unsigned int pct = (beat8(30)*100)/255; // 30 meteors/min

  for ( int z=0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s];
      meteorSize = ledsPerSection * meteorSizePct / 100;
      unsigned int pos = sectionStart[z][s] + ((pct * ledsPerSection+2*meteorSize) / 100);

      // fade brightness all LEDs one step
      for ( int j=0; j<ledsPerSection; j++ ) {
        if ( (!meteorRandomDecay) || (random8(10)>5) ) {
          leds[z][sectionStart[z][s]+j].fadeToBlackBy(meteorTrailDecay);
        }
      }

      for ( int j=0; j<meteorSize; j++ ) {
        if ( (pos-j < sectionEnd[z][s]) && (pos-j >= sectionStart[z][s]) ) {
          leds[z][pos-j] = CRGB::White;
        } 
      }
    }
  }
  
  showStrip();
  FastLED.delay(SpeedDelay);
}

// ***************************************
// ** Common Functions **
// ***************************************

void addGlitter(int zone, int section, fract8 chanceOfGlitter) {
  if ( (random8()*100)/255 < chanceOfGlitter ) {
    for ( int i=0; i<random8(1,5); i++ )  // at least one dot per 50 pixels
      leds[zone][ random16(sectionStart[zone][section],sectionEnd[zone][section]) ] = CRGB::White; // 100% white
  }
}

// Color wheel (get RGB from hue)
CRGB * getRGBfromHue(byte hue) {
  static CRGB c;
  
  if ( hue < 85 ) {
   c.r = hue * 3;
   c.g = 255 - hue * 3;
   c.b = 0;
  } else if ( hue < 170 ) {
   hue -= 85;
   c.r = 255 - hue * 3;
   c.g = 0;
   c.b = hue * 3;
  } else {
   hue -= 170;
   c.r = 0;
   c.g = hue * 3;
   c.b = 255 - hue * 3;
  }

  return &c;
}

CRGB * getRGBfromHeat(byte temp) {
  static CRGB c;

  // Scale 'heat' down from 0-255 to 0-191
  byte t192 = (byte)(((int)temp*191)/255);
 
  // calculate ramp up from
  byte heatramp = t192 & 0x3F; // 0..63
  heatramp <<= 2; // scale up to 0..252
 
  // figure out which third of the spectrum we're in:
  if( t192 > 0x80) {                     // hottest
    c = CRGB(255, 255, heatramp);
  } else if( t192 > 0x40 ) {             // middle
    c = CRGB(255, heatramp, 0);
  } else {                               // coolest
    c = CRGB(heatramp, 0, 0);
  }
  return &c;
}
